fun main () {
    //****************************************************************************************************************

    //val i = scan.nextInt()
    //val b = (i>100)
    //print(b)

    //****************************************************************************************************************

    //print("Введите любое число: ")
    //val i = scan.nextInt()
    //if (i > 99 && i < 1000) print("Число $i является трехзначным числом.")
    //else print("Число $i не является трехзначным числом.")

    //****************************************************************************************************************
    //Напишите программу, которая считывает два числа и выводит true, если первое из них больше второго и false,
    // если это не так

    /*val a = scan.nextInt()
    val b = scan.nextInt()
    val c = (a>b)
    println(c)*/

    //****************************************************************************************************************
    //Напишите программу, которая считывает два числа и выводит false, если они равны и true, если они не равны.

//    val a = scan.nextInt()
//    val b = scan.nextInt()
//    val c = (a!=b)
//    println(c)

    //****************************************************************************************************************
    //Напишите программу, которая считывает переменную типа Boolean и выводит противоположное ей значение.

//    val boo = scan.nextBoolean()
//    print(!boo)
    //****************************************************************************************************************
    //Что выведется на экран в результате работы этой программы?
//    val a = 2
//    val b = 8
//    val c = 6
//
//    if(a*a*a==b)  print("r")
//    if(b > a && b > c)  print("y")
//    if(c+a==b)  print("g")
    //****************************************************************************************************************
    //Напишите программу, которая считывает число и выводит "Да", если оно является чётным.

//    val i = scan.nextInt()
//    if (i%2==0) print("Да")

    //****************************************************************************************************************
    //Напишите программу, которая считывает число и выводит "Да", если оно является чётным и "Нет", если не является.

//    val i = scan.nextInt()
//    if (i%2==0) print("Да")
//    else print("Нет")

    //****************************************************************************************************************
    //Напишите программу, которая считывает число и выводит "Число равно нулю", если число равно 0,
    // "Число положительное", если оно является положительным и "Число отрицательное", если число является
    // отрицательным.

    val i = scan.nextInt()
    if (i==0) print("Число равно нулю")
    else if (i>0) print("Число положительное")
    else print("Число отрицательное")

    //****************************************************************************************************************
}