fun main () {
    //****************************************************************************************************************

    //val i = scan.nextInt()
    //val b = (i>100)
    //print(b)

    //****************************************************************************************************************

    //print("Введите любое число: ")
    //val i = scan.nextInt()
    //if (i > 99 && i < 1000) print("Число $i является трехзначным числом.")
    //else print("Число $i не является трехзначным числом.")

    //****************************************************************************************************************
    //Напишите программу, которая считывает два числа и выводит true, если первое из них больше второго и false,
    // если это не так

    /*val a = scan.nextInt()
    val b = scan.nextInt()
    val c = (a>b)
    println(c)*/

    //****************************************************************************************************************
    //Напишите программу, которая считывает два числа и выводит false, если они равны и true, если они не равны.

    val a = scan.nextInt()
    val b = scan.nextInt()
    val c = (a!=b)
    println(c)

    //****************************************************************************************************************
}