
fun main () {
    //***********************************************************************************************************
    //Напишите программу, которая считывает переменную типа Double и выводит её синус.

//    val i = scan.nextDouble()
//    print(Math.sin(i))

    //***********************************************************************************************************
    //Напишите программу, которая считывает переменную типа Double и выводит её косинус.

//    val i = scan.nextDouble()
//    print(Math.cos(i))

    //***********************************************************************************************************
    //Напишите программу, которая считывает переменную типа Double и выводит её тангенс.

//    val i = scan.nextDouble()
//    print(Math.tan(i))

    //***********************************************************************************************************
    //Напишите программу, которая считывает переменную типа Double и извлекает из неё квадратный корень.

//    val i = scan.nextDouble()
//    print(Math.sqrt(i))

    //***********************************************************************************************************
    //Напишите программу, которая считывает переменную R типа Double - радиус окружности, и выводит площадь круга с
    // таким  радиусом, округлённую по правилам математики

//    print(Math.round(Math.PI*(Math.pow(scan.nextDouble(), 2.0))))

    //***********************************************************************************************************
    //Напишите программу, которая считывает переменные p и h типа Double, рассчитывает давление жидкости на дно
    // и стенки сосуда по формуле P = gph  (g = 9.8) и выводит, округляя по правилам математики.

    val g = 9.8
    print(Math.round(g*scan.nextDouble()*scan.nextDouble()))

    //***********************************************************************************************************
    //***********************************************************************************************************


}