
val scan = java.util.Scanner(System.`in`)
fun main () {

    //****************************************************************************************************************

    //    val str = scan.nextLine()
    //    println(str.toUpperCase())
    //****************************************************************************************************************
    //Напишите программу, которая считывает целое число, делит его на 10 и выводит получившееся частное.

    //    var number = scan.nextInt()
    //    number /=10
    //    println(number)

    //Напишите программу, которая считывает целые числа aa и bb и находит значение выражения: 5*(b-a)

    //    val a = scan.nextInt()
    //    val b = scan.nextInt()
    //    val c = 5*(b - a)
    //    println(c)

    //****************************************************************************************************************
    //Напишите программу, которая считывает два числа и выводит их в обратном порядке через пробел.

    //    val a = scan.nextInt()
    //    val b = scan.nextInt()
    //    println("$b $a")

    //****************************************************************************************************************
    //Напишите программу, которая считывает трехзначное число и разворачивает его.

    //    val str = scan.nextLine()
    //    println("${str[2]}${str[1]}${str[0]}")

    //****************************************************************************************************************
    //Напишите программу, которая считывает два трёхзначных числа и складывает первый и третий разряд
    //каждого из них. Например, если введены числа 191191 и 292292, ответом будет число 6 (1 + 1 + 2 + 2 = 61+1+2+2=6).

    // val str = scan.nextLine().toString()
    // val str1 = str.substringBefore(" ")
    // val str2 = str.substringAfter(" ")
    // val a = str1[0].toString().toInt()
    // val b = str1[2].toString().toInt()
    // val c = str2[0].toString().toInt()
    // val d = str2[2].toString().toInt()
    // println(a+b+c+d)

    //****************************************************************************************************************
    //Напишите программу, которая считывает число от 1000 до 9999, разворачивает его и выводит без ведущих нулей:
    //1300 -> 0031 -> 31 // т.е. нули спереди числа - ведущие нули

    //    val numberRead = scan.nextLine().reversed().substringAfter("0").toInt()
    //    println(numberRead)

    //****************************************************************************************************************
    //Напишите программу, которая считывает строку и печатает её 3 раза через пробел.

    //val str = scan.nextLine().toString() //or println(scan.nextLine().plus(" ").repeat(3))
    //println("$str $str $str")

    //****************************************************************************************************************
    //Считайте 5 слов, введенных через пробел, и выведите их в обратном порядке.
    //fun main(args: Array<String>) = print(readLine()!!.split(" ").reversed().joinToString(" "))

    //val str = scan.nextLine().split(" ")
    //println("${str[4]} ${str[3]} ${str[2]} ${str[1]} ${str[0]}")

    //****************************************************************************************************************
    //Напишите программу, которая считывает строку и выводит её сначала в верхнем регистре, а потом - в нижнем через пробел

    //val str = readLine()!!
    //print("${str.toUpperCase()} ${str.toLowerCase()}")

    //****************************************************************************************************************
    //Задача повышенной сложности.
    //Напишите программу, которая считывает строку s и заменяет символ с индексом 1 на букву F,
    //а предпоследний символ - на букву L.
    //Гарантируется, что строка состоит минимум из четырёх символов.

    val str = readLine()
    print(" ${str?.get(0)}F${str?.substring(2..str.length-3)}L${str?.last()}")

    //****************************************************************************************************************
    //****************************************************************************************************************
    //****************************************************************************************************************
    //****************************************************************************************************************

 }