
val scan = java.util.Scanner(System.`in`)
fun main () {

//*******************************
//    val str = scan.nextLine()
//    println(str.toUpperCase())

//Напишите программу, которая считывает целое число, делит его на 10 и выводит получившееся частное.
//********************************
//    var number = scan.nextInt()
//    number /=10
//    println(number)

//Напишите программу, которая считывает целые числа aa и bb и находит значение выражения: 5*(b-a)
//*******************************
//    val a = scan.nextInt()
//    val b = scan.nextInt()
//    val c = 5*(b - a)
//    println(c)

//Напишите программу, которая считывает два числа и выводит их в обратном порядке через пробел.
//*****************************
//    val a = scan.nextInt()
//    val b = scan.nextInt()
//    println("$b $a")
//Напишите программу, которая считывает трехзначное число и разворачивает его.
//*****************************
//    val str = scan.nextLine()
//    println("${str[2]}${str[1]}${str[0]}")
 }